
public class FallExercise1 {
/*
	1) 추상 클래스란 무엇인가 >> 추상 메소드를 적어도 하나라도 가지고 있는 클래스, 일부 메소드는 구현되지 않고 선언만 되어 있음
	2) 추상 클래스와 일반 클래스의 차이점은 무엇인가? 
>>	추상 클래스에는 abstract 명령어가 붙고 클래스 내에 메소드에 abstract 명령어가 붙을 수도 있고 안 붙을 수도 있으며, 객체 생성이 불가능하다.
	반면 일반 클래스는 클래스와 클래스 내의 메소드에 abstract 명령어가 붙지 않고, 객체 생성이 가능하다 
	3) 추상 클래스는 객체 생성이 가능한가? >> 추상 클래스는 객체 생성이 불가능, 서브 클래스를 통해서만 객체 생성 가능
	4) 추상 클래스는 어떻게 사용되는가? >> 서브 클래스에서 상속을 받아 사용함
	5) 추상 클래스의 역할은 무엇이고 왜 필요한 것인가? 
>>  추상 클래스는 상속을 위한 슈퍼클래스로 활용하여 상속을 받은 서브 클래스에서 다향성을 구현
    계층적인 상속 관계로 중복된 코드를 줄이고 코드를 관리하기 좀 더 쉬움(?)
	6) 추상 클래스는 상속이 가능한가? >> 가능, 단 일반 클래스에서 상속 했을 경우 추상 클래스 내에 있는 추상 메소드를 무조건 구현/선언 해야함
	7) 추상 클래스의 추상 메소드는 꼭 오버라이딩하여 사용해야만 하는가? >> 해야함. 하지 않을 경우 에러 발생
	8) 추상 메소드를 포함하고 있다면 추상 클래스여야 하는가? 
>>  추상 메소드는 일반 클래스 안에서 선언 될 수 없고 추상 클래스 안에서 가능하다. 단, 인터페이스 안에서도 선언 가능
	9) 추상 클래스를 만들려면 abstract를 꼭 써야 하는가? >> abstract 명령어가 추상 클래스/메소드를 만드는 명령어 이므로 사용해야 함
*/
}
